local PLUGIN = PLUGIN

PLUGIN.name = "Trasher"
PLUGIN.author = "БО, джеймс Б.О!"
PLUGIN.description = "У него там тарелка в кустах под Выборгом"

--[[


———————————No cmbmutant.xyz?———————————
⠀⣞⢽⢪⢣⢣⢣⢫⡺⡵⣝⡮⣗⢷⢽⢽⢽⣮⡷⡽⣜⣜⢮⢺⣜⢷⢽⢝⡽⣝
⠸⡸⠜⠕⠕⠁⢁⢇⢏⢽⢺⣪⡳⡝⣎⣏⢯⢞⡿⣟⣷⣳⢯⡷⣽⢽⢯⣳⣫⠇
⠀⠀⢀⢀⢄⢬⢪⡪⡎⣆⡈⠚⠜⠕⠇⠗⠝⢕⢯⢫⣞⣯⣿⣻⡽⣏⢗⣗⠏⠀
⠀⠪⡪⡪⣪⢪⢺⢸⢢⢓⢆⢤⢀⠀⠀⠀⠀⠈⢊⢞⡾⣿⡯⣏⢮⠷⠁⠀⠀
⠀⠀⠀⠈⠊⠆⡃⠕⢕⢇⢇⢇⢇⢇⢏⢎⢎⢆⢄⠀⢑⣽⣿⢝⠲⠉⠀⠀⠀⠀
⠀⠀⠀⠀⠀⡿⠂⠠⠀⡇⢇⠕⢈⣀⠀⠁⠡⠣⡣⡫⣂⣿⠯⢪⠰⠂⠀⠀⠀⠀
⠀⠀⠀⠀⡦⡙⡂⢀⢤⢣⠣⡈⣾⡃⠠⠄⠀⡄⢱⣌⣶⢏⢊⠂⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⢝⡲⣜⡮⡏⢎⢌⢂⠙⠢⠐⢀⢘⢵⣽⣿⡿⠁⠁⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠨⣺⡺⡕⡕⡱⡑⡆⡕⡅⡕⡜⡼⢽⡻⠏⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⣼⣳⣫⣾⣵⣗⡵⡱⡡⢣⢑⢕⢜⢕⡝⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⣴⣿⣾⣿⣿⣿⡿⡽⡑⢌⠪⡢⡣⣣⡟⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⡟⡾⣿⢿⢿⢵⣽⣾⣼⣘⢸⢸⣞⡟⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠁⠇⠡⠩⡫⢿⣝⡻⡮⣒⢽⠋⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
—————————————————————————————————————
]]


ix.config.Add(
    "Trash Search Time",
    10,
    "Сколько времени уйдет на то, чтобы обыскать кучу мусора.",
    nil,
    {
	    data = {min = 1, max = 60},
	    category = "Мусор"
    }
)

ix.config.Add(
    "Trash Search Chance",
    30,
    "Шанс найти что-нибудь в куче мусора",
    nil,
    {
        data = {min = 1, max = 100},
        category = "Мусор"
    }
)
ix.config.Add(
    "Trash Search Multiplier",
    0.75,
    "Повышает шанс найти несколько предметов в куче мусора",
    nil,
    {
        data = {min = 0.0, max = 3.0, decimals = 2},
        category = "Мусор"
    }
)
ix.config.Add(
    "Trash Search Max Items",
    3,
    "Максимальное количество предметов, которое можно найти в куче мусора",
    nil,
    {
        data = {min = 1, max = 10},
        category = "Мусор"
    }
)
ix.config.Add(
    "Trash Spawner Respawn Time",
    60,
    "Среднее число минут, нужно для спауна новой кучи мусора.",
    nil,
    {
        data = {min = 1, max = 240},
        category = "Мусор"
    }
)

ix.config.Add(
    "Trash Spawner Respawn Variation",
    30,
    "Сколько минут вариации должно быть в спауне мусора.",
    nil,
    {
        data = {min = 1, max = 240},
        category = "Мусор"
    }
)

ix.util.Include("sv_plugin.lua")
