ITEM.name = "Разгрузка «ВАРДЕН»"
ITEM.description = "Универсальная модульная транспортно-боевая система (ВАРДЕН-СППО) «ВАРДЕН» официально является частью снаряжения вооружённых сил Ордена. Жилет изготовлен по модульной технологии в нескольких комплектациях для конкретной боевой задачи. Данная система включает в себя жилетную основу, подсумки различного назначения и ранцы. За счёт того, что жилетная основа изготовлена на базе системы MOLLE, к ней можно крепить различные совместимые подсумки помимо тех, что есть в комплекте. В поясном ремне системы имеются мягкие амортизирующие вставки, а внутри она выполнена из вентилируемого материала. \n Одним словом - настоящее сокровище.."
ITEM.exRender = true 
ITEM.model = "models/hardbass/stalker_sv_nauchniybelt.mdl"
ITEM.width = 2
ITEM.height = 2
ITEM.iconCam = {
	pos = Vector(728.09, 6.1, 93.29),
	ang = Angle(7.28, 180.47, 0),
	fov = 1.64
}
ITEM.invWidth = 4
ITEM.invHeight = 2
ITEM.bodyGroups = {
    ["Броня"] = 5
}