ITEM.name = "ПНВ - КЛАСС 1"
ITEM.description = "Класс оптико-электронных приборов, обеспечивающих оператора изображением местности в условиях недостаточной освещённости. Приборы данного вида нашли широкое применение при ночных боевых действиях, для ведения скрытного наблюдения в тёмное время суток и в тёмных помещениях, вождения машин без использования демаскирующего света фар и т. п.. Несмотря на ряд преимуществ, которые они дают своему обладателю, отмечается, что подавляющее большинство имеющихся моделей не способно предоставить возможность периферийного зрения, что обуславливает необходимость специальных тренировок для эффективного их применения. \n \n \n ИМЕЕТСЯ ГОЛУБАЯ ГРАВИРОВКА"
ITEM.Color = "BlueGreen"
ITEM.category = "[REBORN] ELECTRONIC"

ITEM.exRender = true
ITEM.model = "models/kek1ch/dev_torch_light.mdl"
ITEM.width = 1
ITEM.height = 1
ITEM.iconCam = {
	pos = Vector(-725.87, -92.14, 59.33),
	ang = Angle(4.59, 367.24, 0),
	fov = 0.57
}